results/blogPost/benchclient1/quarkus-io-thread-10000-WARM-UP.wrk2.out
Running 1m test @ http://benchserver4G1:8080/hello/Grahame
  4 threads and 100 connections
  Thread calibration: mean lat.: 4.328ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 3.718ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 4.208ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 4.386ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.03ms  496.43us   4.21ms   60.84%
    Req/Sec     2.65k   276.86     4.22k    83.26%
  599433 requests in 1.00m, 29.73MB read
Requests/sec:   9990.25
Transfer/sec:    507.32KB