results/blogPost/benchclient1/quarkus-io-thread-120000-MEASURE.wrk2.out
Running 1m test @ http://benchserver4G1:8080/hello/Grahame
  4 threads and 100 connections
  Thread calibration: mean lat.: 1.291ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.276ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.287ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.289ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.29ms  660.65us   7.94ms   65.26%
    Req/Sec    31.64k     2.33k   45.11k    69.26%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.24ms
 75.000%    1.74ms
 90.000%    2.19ms
 99.000%    2.92ms
 99.900%    3.49ms
 99.990%    4.53ms
 99.999%    6.81ms
100.000%    7.95ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.043     0.000000            1         1.00
       0.443     0.100000       599146         1.11
       0.677     0.200000      1197974         1.25
       0.880     0.300000      1797448         1.43
       1.067     0.400000      2396861         1.67
       1.241     0.500000      2993238         2.00
       1.330     0.550000      3294529         2.22
       1.422     0.600000      3591449         2.50
       1.521     0.650000      3892435         2.86
       1.626     0.700000      4191667         3.33
       1.740     0.750000      4490728         4.00
       1.801     0.775000      4639041         4.44
       1.866     0.800000      4788003         5.00
       1.936     0.825000      4937742         5.71
       2.012     0.850000      5087302         6.67
       2.097     0.875000      5238399         8.00
       2.143     0.887500      5312314         8.89
       2.193     0.900000      5386980        10.00
       2.249     0.912500      5463148        11.43
       2.309     0.925000      5536364        13.33
       2.379     0.937500      5611058        16.00
       2.419     0.943750      5650043        17.78
       2.459     0.950000      5686056        20.00
       2.505     0.956250      5723915        22.86
       2.555     0.962500      5761357        26.67
       2.611     0.968750      5798651        32.00
       2.643     0.971875      5817757        35.56
       2.675     0.975000      5835318        40.00
       2.713     0.978125      5854055        45.71
       2.757     0.981250      5873441        53.33
       2.805     0.984375      5891633        64.00
       2.833     0.985938      5901219        71.11
       2.863     0.987500      5910336        80.00
       2.897     0.989062      5919780        91.43
       2.935     0.990625      5929064       106.67
       2.981     0.992188      5938550       128.00
       3.005     0.992969      5942864       142.22
       3.035     0.993750      5947656       160.00
       3.067     0.994531      5952296       182.86
       3.105     0.995313      5956962       213.33
       3.149     0.996094      5961582       256.00
       3.175     0.996484      5963923       284.44
       3.205     0.996875      5966342       320.00
       3.237     0.997266      5968664       365.71
       3.275     0.997656      5971015       426.67
       3.319     0.998047      5973307       512.00
       3.345     0.998242      5974466       568.89
       3.375     0.998437      5975614       640.00
       3.409     0.998633      5976757       731.43
       3.449     0.998828      5977955       853.33
       3.495     0.999023      5979099      1024.00
       3.523     0.999121      5979692      1137.78
       3.555     0.999219      5980267      1280.00
       3.593     0.999316      5980858      1462.86
       3.643     0.999414      5981429      1706.67
       3.701     0.999512      5982022      2048.00
       3.733     0.999561      5982303      2275.56
       3.773     0.999609      5982596      2560.00
       3.813     0.999658      5982889      2925.71
       3.873     0.999707      5983179      3413.33
       3.947     0.999756      5983480      4096.00
       3.995     0.999780      5983620      4551.11
       4.057     0.999805      5983764      5120.00
       4.143     0.999829      5983910      5851.43
       4.247     0.999854      5984062      6826.67
       4.367     0.999878      5984205      8192.00
       4.435     0.999890      5984275      9102.22
       4.551     0.999902      5984348     10240.00
       4.667     0.999915      5984422     11702.86
       4.795     0.999927      5984494     13653.33
       4.979     0.999939      5984568     16384.00
       5.095     0.999945      5984605     18204.44
       5.243     0.999951      5984641     20480.00
       5.419     0.999957      5984678     23405.71
       5.543     0.999963      5984714     27306.67
       5.759     0.999969      5984750     32768.00
       5.887     0.999973      5984768     36408.89
       5.975     0.999976      5984787     40960.00
       6.147     0.999979      5984805     46811.43
       6.351     0.999982      5984824     54613.33
       6.483     0.999985      5984841     65536.00
       6.551     0.999986      5984850     72817.78
       6.619     0.999988      5984859     81920.00
       6.747     0.999989      5984869     93622.86
       6.871     0.999991      5984878    109226.67
       6.999     0.999992      5984887    131072.00
       7.039     0.999993      5984891    145635.56
       7.055     0.999994      5984896    163840.00
       7.079     0.999995      5984901    187245.71
       7.115     0.999995      5984906    218453.33
       7.195     0.999996      5984910    262144.00
       7.231     0.999997      5984912    291271.11
       7.275     0.999997      5984914    327680.00
       7.423     0.999997      5984917    374491.43
       7.491     0.999998      5984919    436906.67
       7.507     0.999998      5984921    524288.00
       7.527     0.999998      5984922    582542.22
       7.603     0.999998      5984923    655360.00
       7.723     0.999999      5984925    748982.86
       7.727     0.999999      5984926    873813.33
       7.775     0.999999      5984927   1048576.00
       7.775     0.999999      5984927   1165084.44
       7.831     0.999999      5984928   1310720.00
       7.859     0.999999      5984929   1497965.71
       7.859     0.999999      5984929   1747626.67
       7.863     1.000000      5984930   2097152.00
       7.863     1.000000      5984930   2330168.89
       7.863     1.000000      5984930   2621440.00
       7.895     1.000000      5984931   2995931.43
       7.895     1.000000      5984931   3495253.33
       7.895     1.000000      5984931   4194304.00
       7.895     1.000000      5984931   4660337.78
       7.895     1.000000      5984931   5242880.00
       7.947     1.000000      5984932   5991862.86
       7.947     1.000000      5984932          inf
#[Mean    =        1.291, StdDeviation   =        0.661]
#[Max     =        7.944, Total count    =      5984932]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  7192529 requests in 1.00m, 356.69MB read
Requests/sec: 119875.68
Transfer/sec:      5.94MB