results/blogPost/benchclient1/quarkus-io-thread-30000-MEASURE.wrk2.out
Running 1m test @ http://benchserver4G1:8080/hello/Grahame
  4 threads and 100 connections
  Thread calibration: mean lat.: 1.073ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.065ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.064ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.061ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.05ms  468.98us   4.05ms   62.98%
    Req/Sec     7.91k   467.55     9.78k    75.38%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.04ms
 75.000%    1.41ms
 90.000%    1.69ms
 99.000%    2.12ms
 99.900%    2.44ms
 99.990%    2.77ms
 99.999%    3.54ms
100.000%    4.05ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.070     0.000000            2         1.00
       0.442     0.100000       150115         1.11
       0.599     0.200000       299774         1.25
       0.747     0.300000       449518         1.43
       0.896     0.400000       598706         1.67
       1.037     0.500000       748519         2.00
       1.106     0.550000       823580         2.22
       1.176     0.600000       898123         2.50
       1.251     0.650000       972948         2.86
       1.329     0.700000      1048160         3.33
       1.407     0.750000      1122178         4.00
       1.448     0.775000      1159950         4.44
       1.490     0.800000      1197482         5.00
       1.534     0.825000      1234961         5.71
       1.581     0.850000      1272579         6.67
       1.631     0.875000      1309592         8.00
       1.658     0.887500      1328471         8.89
       1.686     0.900000      1346700        10.00
       1.717     0.912500      1365749        11.43
       1.751     0.925000      1384463        13.33
       1.789     0.937500      1402938        16.00
       1.811     0.943750      1412337        17.78
       1.835     0.950000      1421792        20.00
       1.861     0.956250      1431001        22.86
       1.891     0.962500      1440155        26.67
       1.925     0.968750      1449469        32.00
       1.945     0.971875      1454260        35.56
       1.966     0.975000      1458823        40.00
       1.990     0.978125      1463575        45.71
       2.017     0.981250      1468297        53.33
       2.046     0.984375      1472851        64.00
       2.065     0.985938      1475439        71.11
       2.083     0.987500      1477697        80.00
       2.105     0.989062      1480052        91.43
       2.129     0.990625      1482389       106.67
       2.155     0.992188      1484545       128.00
       2.171     0.992969      1485707       142.22
       2.189     0.993750      1486917       160.00
       2.209     0.994531      1488068       182.86
       2.233     0.995313      1489284       213.33
       2.259     0.996094      1490401       256.00
       2.275     0.996484      1490985       284.44
       2.293     0.996875      1491597       320.00
       2.311     0.997266      1492169       365.71
       2.333     0.997656      1492718       426.67
       2.357     0.998047      1493335       512.00
       2.371     0.998242      1493604       568.89
       2.387     0.998437      1493896       640.00
       2.405     0.998633      1494196       731.43
       2.425     0.998828      1494488       853.33
       2.449     0.999023      1494771      1024.00
       2.463     0.999121      1494921      1137.78
       2.479     0.999219      1495067      1280.00
       2.497     0.999316      1495215      1462.86
       2.517     0.999414      1495359      1706.67
       2.539     0.999512      1495495      2048.00
       2.555     0.999561      1495574      2275.56
       2.569     0.999609      1495640      2560.00
       2.585     0.999658      1495710      2925.71
       2.607     0.999707      1495783      3413.33
       2.635     0.999756      1495859      4096.00
       2.649     0.999780      1495896      4551.11
       2.665     0.999805      1495932      5120.00
       2.683     0.999829      1495967      5851.43
       2.707     0.999854      1496004      6826.67
       2.735     0.999878      1496040      8192.00
       2.749     0.999890      1496057      9102.22
       2.771     0.999902      1496075     10240.00
       2.793     0.999915      1496094     11702.86
       2.821     0.999927      1496113     13653.33
       2.847     0.999939      1496130     16384.00
       2.867     0.999945      1496139     18204.44
       2.887     0.999951      1496148     20480.00
       2.911     0.999957      1496158     23405.71
       2.957     0.999963      1496167     27306.67
       2.993     0.999969      1496177     32768.00
       3.011     0.999973      1496180     36408.89
       3.041     0.999976      1496185     40960.00
       3.209     0.999979      1496190     46811.43
       3.295     0.999982      1496194     54613.33
       3.413     0.999985      1496199     65536.00
       3.433     0.999986      1496201     72817.78
       3.473     0.999988      1496203     81920.00
       3.535     0.999989      1496206     93622.86
       3.589     0.999991      1496208    109226.67
       3.633     0.999992      1496210    131072.00
       3.667     0.999993      1496211    145635.56
       3.669     0.999994      1496212    163840.00
       3.741     0.999995      1496214    187245.71
       3.745     0.999995      1496215    218453.33
       3.759     0.999996      1496216    262144.00
       3.759     0.999997      1496216    291271.11
       3.761     0.999997      1496217    327680.00
       3.799     0.999997      1496218    374491.43
       3.799     0.999998      1496218    436906.67
       3.805     0.999998      1496219    524288.00
       3.805     0.999998      1496219    582542.22
       3.805     0.999998      1496219    655360.00
       3.991     0.999999      1496220    748982.86
       3.991     0.999999      1496220    873813.33
       3.991     0.999999      1496220   1048576.00
       3.991     0.999999      1496220   1165084.44
       3.991     0.999999      1496220   1310720.00
       4.049     0.999999      1496221   1497965.71
       4.049     1.000000      1496221          inf
#[Mean    =        1.054, StdDeviation   =        0.469]
#[Max     =        4.048, Total count    =      1496221]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  1798187 requests in 1.00m, 89.17MB read
Requests/sec:  29969.92
Transfer/sec:      1.49MB