results/blogPost/benchclient1/quarkus-io-thread-30000-WARM-UP.wrk2.out
Running 1m test @ http://benchserver4G1:8080/hello/Grahame
  4 threads and 100 connections
  Thread calibration: mean lat.: 1.037ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.047ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.036ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.058ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.05ms  467.32us   3.49ms   62.67%
    Req/Sec     7.91k   470.86     9.78k    75.83%
  1798179 requests in 1.00m, 89.17MB read
Requests/sec:  29969.32
Transfer/sec:      1.49MB